# Developer tools
tap "withgraphite/tap" 
tap "spacelift-io/spacelift"
brew "bazelisk"
brew "clang-format"
brew "docker"
brew "googletest"
brew "google-benchmark"
brew "withgraphite/tap/graphite"
brew "spacelift-io/spacelift/spacectl"
brew "uv"
brew "node@24"
brew "gh"
brew "jq"
brew "gitleaks"
brew "ninja"

# Kubernetes local testing tools
brew "kubectl"
brew "kind"
