# Developer tools
tap "withgraphite/tap"
tap "aws/homebrew-aws"
tap "spacelift-io/spacelift"
brew "aws/aws/amazon-efs-utils"
brew "awscli"
brew "bazelisk"
brew "clang-format"
brew "docker"
brew "googletest"
brew "google-benchmark"
cask "session-manager-plugin"
brew "withgraphite/tap/graphite"
brew "spacelift-io/spacelift/spacectl"
brew "uv"
brew "node@24"
brew "npm"
brew "gh"
brew "asdf"

# Kubernetes local testing tools
brew "kubectl"
brew "kind"
