{
  "architectures": [
    "MettaPolicyForRL"
  ],
  "auto_map": {
    "AutoConfig": [
      "hf_metta_policy.configuration_metta_policy",
      "MettaPolicyConfig"
    ],
    "AutoModel": [
      "hf_metta_policy.modeling_metta_policy",
      "MettaPolicyForRL"
    ]
  },
  "checkpoint_filename": "policy.pt",
  "code_roots": [
    "agent/src",
    "metta",
    "packages/mettagrid/python/src"
  ],
  "code_snapshot_subdir": "code_snapshot",
  "extra_metadata": {},
  "model_type": "metta-policy",
  "source_commit": "b2351f455097113973fa50daa9bab3dbfa7a135f",
  "transformers_version": "4.57.1"
}
