{
  "architectures": [
    "MettaPolicyForRL"
  ],
  "auto_map": {
    "AutoConfig": [
      "hf_metta_policy.configuration_metta_policy",
      "MettaPolicyConfig"
    ],
    "AutoModel": [
      "hf_metta_policy.modeling_metta_policy",
      "MettaPolicyForRL"
    ]
  },
  "checkpoint_filename": "policy.pt",
  "code_roots": [
    "agent/src",
    "metta"
  ],
  "code_snapshot_subdir": "code_snapshot",
  "extra_metadata": {},
  "model_type": "metta-policy",
  "source_commit": "ab339e6e61c09f9d7db7ab227078d5bb5e8eabf2",
  "transformers_version": "4.57.1"
}
